ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L4xx/stm32l4p5xx.h
/********************  Bits definition for PSSI_SR register  ******************/
#define PSSI_SR_RTT4B_Pos             (2U)
#define PSSI_SR_RTT4B_Msk             (0x1UL << PSSI_SR_RTT4B_Pos)             /*!< 0x00000004 */
#define PSSI_SR_RTT4B                 PSSI_SR_RTT4B_Msk                        /*!< FIFO is Ready To Transfer 4 Bytes */
#define PSSI_SR_RTT1B_Pos             (3U)
#define PSSI_SR_RTT1B_Msk             (0x1UL << PSSI_SR_RTT1B_Pos)             /*!< 0x00000008 */
#define PSSI_SR_RTT1B                 PSSI_SR_RTT1B_Msk                        /*!< FIFO is Ready To Transfer 1 Byte */

/********************  Bits definition for PSSI_RIS register  *****************/
#define PSSI_RIS_OVR_RIS_Pos          (1U)
#define PSSI_RIS_OVR_RIS_Msk          (0x1UL << PSSI_RIS_OVR_RIS_Pos)          /*!< 0x00000002 */
#define PSSI_RIS_OVR_RIS              PSSI_RIS_OVR_RIS_Msk                     /*!< Data buffer overrun/underrun raw interrupt status */

/********************  Bits definition for PSSI_IER register  *****************/
#define PSSI_IER_OVR_IE_Pos           (1U)
#define PSSI_IER_OVR_IE_Msk           (0x1UL << PSSI_IER_OVR_IE_Pos)           /*!< 0x00000002 */
#define PSSI_IER_OVR_IE               PSSI_IER_OVR_IE_Msk                      /*!< Data buffer overrun/underrun interrupt enable */

/********************  Bits definition for PSSI_MIS register  *****************/
#define PSSI_MIS_OVR_MIS_Pos          (1U)
#define PSSI_MIS_OVR_MIS_Msk          (0x1UL << PSSI_MIS_OVR_MIS_Pos)          /*!< 0x00000002 */
#define PSSI_MIS_OVR_MIS              PSSI_MIS_OVR_MIS_Msk                     /*!< Data buffer overrun/underrun masked interrupt status */

/********************  Bits definition for PSSI_ICR register  *****************/
#define PSSI_ICR_OVR_ISC_Pos          (1U)
#define PSSI_ICR_OVR_ISC_Msk          (0x1UL << PSSI_ICR_OVR_ISC_Pos)          /*!< 0x00000002 */
#define PSSI_ICR_OVR_ISC              PSSI_ICR_OVR_ISC_Msk                     /*!< Data buffer overrun/underrun interrupt status clear */

/********************  Bits definition for PSSI_DR register  **************/
#define PSSI_DR_BYTE0_Pos             (0U)
#define PSSI_DR_BYTE0_Msk             (0xFFUL << PSSI_DR_BYTE0_Pos)            /*!< 0x000000FF */
#define PSSI_DR_BYTE0                 PSSI_DR_BYTE0_Msk                        /*!< PSSI Data byte 0 Byte0[7:0] */
#define PSSI_DR_BYTE0_0               (0x01UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000001 */
#define PSSI_DR_BYTE0_1               (0x02UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000002 */
#define PSSI_DR_BYTE0_2               (0x04UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000004 */
#define PSSI_DR_BYTE0_3               (0x08UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000008 */
#define PSSI_DR_BYTE0_4               (0x10UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000010 */
#define PSSI_DR_BYTE0_5               (0x20UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000020 */
#define PSSI_DR_BYTE0_6               (0x40UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000040 */
#define PSSI_DR_BYTE0_7               (0x80UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000080 */
#define PSSI_DR_BYTE1_Pos             (8U)
#define PSSI_DR_BYTE1_Msk             (0xFFUL << PSSI_DR_BYTE1_Pos)            /*!< 0x0000FF00 */
#define PSSI_DR_BYTE1                 PSSI_DR_BYTE1_Msk                        /*!< PSSI Data byte 1 Byte1[7:0] */
#define PSSI_DR_BYTE1_0               (0x01UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000100 */
#define PSSI_DR_BYTE1_1               (0x02UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000200 */
#define PSSI_DR_BYTE1_2               (0x04UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000400 */
#define PSSI_DR_BYTE1_3               (0x08UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000800 */
#define PSSI_DR_BYTE1_4               (0x10UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00001000 */
#define PSSI_DR_BYTE1_5               (0x20UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00002000 */
#define PSSI_DR_BYTE1_6               (0x40UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00004000 */
#define PSSI_DR_BYTE1_7               (0x80UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00008000 */
#define PSSI_DR_BYTE2_Pos             (16U)
#define PSSI_DR_BYTE2_Msk             (0xFFUL << PSSI_DR_BYTE2_Pos)            /*!< 0x00FF0000 */
#define PSSI_DR_BYTE2                 PSSI_DR_BYTE2_Msk                        /*!< PSSI Data byte 2 Byte2[7:0] */
#define PSSI_DR_BYTE2_0               (0x01UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00010000 */
#define PSSI_DR_BYTE2_1               (0x02UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00020000 */
#define PSSI_DR_BYTE2_2               (0x04UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00040000 */
#define PSSI_DR_BYTE2_3               (0x08UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00080000 */
#define PSSI_DR_BYTE2_4               (0x10UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00100000 */
#define PSSI_DR_BYTE2_5               (0x20UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00200000 */
#define PSSI_DR_BYTE2_6               (0x40UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00400000 */
#define PSSI_DR_BYTE2_7               (0x80UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00800000 */
#define PSSI_DR_BYTE3_Pos             (24U)
#define PSSI_DR_BYTE3_Msk             (0xFFUL << PSSI_DR_BYTE3_Pos)            /*!< 0xFF000000 */
#define PSSI_DR_BYTE3                 PSSI_DR_BYTE3_Msk                        /*!< PSSI Data byte 3 Byte3[7:0] */
#define PSSI_DR_BYTE3_0               (0x01UL << PSSI_DR_BYTE3_Pos)            /*!< 0x01000000 */
#define PSSI_DR_BYTE3_1               (0x02UL << PSSI_DR_BYTE3_Pos)            /*!< 0x02000000 */
#define PSSI_DR_BYTE3_2               (0x04UL << PSSI_DR_BYTE3_Pos)            /*!< 0x04000000 */
#define PSSI_DR_BYTE3_3               (0x08UL << PSSI_DR_BYTE3_Pos)            /*!< 0x08000000 */
#define PSSI_DR_BYTE3_4               (0x10UL << PSSI_DR_BYTE3_Pos)            /*!< 0x10000000 */
#define PSSI_DR_BYTE3_5               (0x20UL << PSSI_DR_BYTE3_Pos)            /*!< 0x20000000 */
#define PSSI_DR_BYTE3_6               (0x40UL << PSSI_DR_BYTE3_Pos)            /*!< 0x40000000 */
#define PSSI_DR_BYTE3_7               (0x80UL << PSSI_DR_BYTE3_Pos)            /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CR1 register  ********************/

#define PWR_CR1_LPR_Pos              (14U)
#define PWR_CR1_LPR_Msk              (0x1UL << PWR_CR1_LPR_Pos)                /*!< 0x00004000 */
#define PWR_CR1_LPR                  PWR_CR1_LPR_Msk                           /*!< Regulator low-power mode */
#define PWR_CR1_VOS_Pos              (9U)
#define PWR_CR1_VOS_Msk              (0x3UL << PWR_CR1_VOS_Pos)                /*!< 0x00000600 */
#define PWR_CR1_VOS                  PWR_CR1_VOS_Msk                           /*!< VOS[1:0] bits (Regulator voltage scaling output selection) */
#define PWR_CR1_VOS_0                (0x1UL << PWR_CR1_VOS_Pos)                /*!< 0x00000200 */
#define PWR_CR1_VOS_1                (0x2UL << PWR_CR1_VOS_Pos)                /*!< 0x00000400 */
#define PWR_CR1_DBP_Pos              (8U)
#define PWR_CR1_DBP_Msk              (0x1UL << PWR_CR1_DBP_Pos)                /*!< 0x00000100 */
#define PWR_CR1_DBP                  PWR_CR1_DBP_Msk                           /*!< Disable Back-up domain Protection */
#define PWR_CR1_RRSTP_Pos            (4U)
#define PWR_CR1_RRSTP_Msk            (0x1UL << PWR_CR1_RRSTP_Pos)              /*!< 0x00000010 */
#define PWR_CR1_RRSTP                PWR_CR1_RRSTP_Msk                         /*!< SRAM3 Retention in Stop 2 mode */
#define PWR_CR1_LPMS_Pos             (0U)
#define PWR_CR1_LPMS_Msk             (0x7UL << PWR_CR1_LPMS_Pos)               /*!< 0x00000007 */
#define PWR_CR1_LPMS                 PWR_CR1_LPMS_Msk                          /*!< Low-power mode selection field */
#define PWR_CR1_LPMS_STOP0           (0x00000000UL)                            /*!< Stop 0 mode */
#define PWR_CR1_LPMS_STOP1_Pos       (0U)
#define PWR_CR1_LPMS_STOP1_Msk       (0x1UL << PWR_CR1_LPMS_STOP1_Pos)         /*!< 0x00000001 */
#define PWR_CR1_LPMS_STOP1           PWR_CR1_LPMS_STOP1_Msk                    /*!< Stop 1 mode */
#define PWR_CR1_LPMS_STOP2_Pos       (1U)
#define PWR_CR1_LPMS_STOP2_Msk       (0x1UL << PWR_CR1_LPMS_STOP2_Pos)         /*!< 0x00000002 */
#define PWR_CR1_LPMS_STOP2           PWR_CR1_LPMS_STOP2_Msk                    /*!< Stop 2 mode */
#define PWR_CR1_LPMS_STANDBY_Pos     (0U)
#define PWR_CR1_LPMS_STANDBY_Msk     (0x3UL << PWR_CR1_LPMS_STANDBY_Pos)       /*!< 0x00000003 */
#define PWR_CR1_LPMS_STANDBY         PWR_CR1_LPMS_STANDBY_Msk                  /*!< Stand-by mode */
#define PWR_CR1_LPMS_SHUTDOWN_Pos    (2U)
#define PWR_CR1_LPMS_SHUTDOWN_Msk    (0x1UL << PWR_CR1_LPMS_SHUTDOWN_Pos)      /*!< 0x00000004 */
#define PWR_CR1_LPMS_SHUTDOWN        PWR_CR1_LPMS_SHUTDOWN_Msk                 /*!< Shut-down mode */


/********************  Bit definition for PWR_CR2 register  ********************/
#define PWR_CR2_USV_Pos              (10U)
#define PWR_CR2_USV_Msk              (0x1UL << PWR_CR2_USV_Pos)                /*!< 0x00000400 */
#define PWR_CR2_USV                  PWR_CR2_USV_Msk                           /*!< VDD USB Supply Valid */
#define PWR_CR2_IOSV_Pos             (9U)
#define PWR_CR2_IOSV_Msk             (0x1UL << PWR_CR2_IOSV_Pos)               /*!< 0x00000200 */
#define PWR_CR2_IOSV                 PWR_CR2_IOSV_Msk                          /*!< VDD IO2 independent I/Os Supply Valid */
/*!< PVME  Peripheral Voltage Monitor Enable */
#define PWR_CR2_PVME_Pos             (4U)
#define PWR_CR2_PVME_Msk             (0xFUL << PWR_CR2_PVME_Pos)               /*!< 0x000000F0 */
#define PWR_CR2_PVME                 PWR_CR2_PVME_Msk                          /*!< PVM bits field */
#define PWR_CR2_PVME4_Pos            (7U)
#define PWR_CR2_PVME4_Msk            (0x1UL << PWR_CR2_PVME4_Pos)              /*!< 0x00000080 */
#define PWR_CR2_PVME4                PWR_CR2_PVME4_Msk                         /*!< PVM 4 Enable */
#define PWR_CR2_PVME3_Pos            (6U)
#define PWR_CR2_PVME3_Msk            (0x1UL << PWR_CR2_PVME3_Pos)              /*!< 0x00000040 */
#define PWR_CR2_PVME3                PWR_CR2_PVME3_Msk                         /*!< PVM 3 Enable */
#define PWR_CR2_PVME2_Pos            (5U)
#define PWR_CR2_PVME2_Msk            (0x1UL << PWR_CR2_PVME2_Pos)              /*!< 0x00000020 */
#define PWR_CR2_PVME2                PWR_CR2_PVME2_Msk                         /*!< PVM 2 Enable */
#define PWR_CR2_PVME1_Pos            (4U)
#define PWR_CR2_PVME1_Msk            (0x1UL << PWR_CR2_PVME1_Pos)              /*!< 0x00000010 */
#define PWR_CR2_PVME1                PWR_CR2_PVME1_Msk                         /*!< PVM 1 Enable */
/*!< PVD level configuration */
#define PWR_CR2_PLS_Pos              (1U)
#define PWR_CR2_PLS_Msk              (0x7UL << PWR_CR2_PLS_Pos)                /*!< 0x0000000E */
#define PWR_CR2_PLS                  PWR_CR2_PLS_Msk                           /*!< PVD level selection */
#define PWR_CR2_PLS_LEV0             (0x00000000UL)                            /*!< PVD level 0 */
#define PWR_CR2_PLS_LEV1_Pos         (1U)
#define PWR_CR2_PLS_LEV1_Msk         (0x1UL << PWR_CR2_PLS_LEV1_Pos)           /*!< 0x00000002 */
#define PWR_CR2_PLS_LEV1             PWR_CR2_PLS_LEV1_Msk                      /*!< PVD level 1 */
#define PWR_CR2_PLS_LEV2_Pos         (2U)
#define PWR_CR2_PLS_LEV2_Msk         (0x1UL << PWR_CR2_PLS_LEV2_Pos)           /*!< 0x00000004 */
#define PWR_CR2_PLS_LEV2             PWR_CR2_PLS_LEV2_Msk                      /*!< PVD level 2 */
#define PWR_CR2_PLS_LEV3_Pos         (1U)
#define PWR_CR2_PLS_LEV3_Msk         (0x3UL << PWR_CR2_PLS_LEV3_Pos)           /*!< 0x00000006 */
#define PWR_CR2_PLS_LEV3             PWR_CR2_PLS_LEV3_Msk                      /*!< PVD level 3 */
#define PWR_CR2_PLS_LEV4_Pos         (3U)
#define PWR_CR2_PLS_LEV4_Msk         (0x1UL << PWR_CR2_PLS_LEV4_Pos)           /*!< 0x00000008 */
#define PWR_CR2_PLS_LEV4             PWR_CR2_PLS_LEV4_Msk                      /*!< PVD level 4 */
#define PWR_CR2_PLS_LEV5_Pos         (1U)
#define PWR_CR2_PLS_LEV5_Msk         (0x5UL << PWR_CR2_PLS_LEV5_Pos)           /*!< 0x0000000A */
#define PWR_CR2_PLS_LEV5             PWR_CR2_PLS_LEV5_Msk                      /*!< PVD level 5 */
#define PWR_CR2_PLS_LEV6_Pos         (2U)
#define PWR_CR2_PLS_LEV6_Msk         (0x3UL << PWR_CR2_PLS_LEV6_Pos)           /*!< 0x0000000C */
#define PWR_CR2_PLS_LEV6             PWR_CR2_PLS_LEV6_Msk                      /*!< PVD level 6 */
#define PWR_CR2_PLS_LEV7_Pos         (1U)
#define PWR_CR2_PLS_LEV7_Msk         (0x7UL << PWR_CR2_PLS_LEV7_Pos)           /*!< 0x0000000E */
#define PWR_CR2_PLS_LEV7             PWR_CR2_PLS_LEV7_Msk                      /*!< PVD level 7 */
#define PWR_CR2_PVDE_Pos             (0U)
#define PWR_CR2_PVDE_Msk             (0x1UL << PWR_CR2_PVDE_Pos)               /*!< 0x00000001 */
#define PWR_CR2_PVDE                 PWR_CR2_PVDE_Msk                          /*!< Power Voltage Detector Enable */

